{
    "HSBC": {
        "title": "HSBC BANK ARGENTINA S.A.",
        "body": "Encontré una vulnerabilidad mientras probaba un aplicativo web de alta de productos financieros (tales como cajas de ahorro, CGU y tarjetas de crédito). Al realizar pruebas exploratorias en el módulo de validación de identidad mediante el anverso, el reverso del DNI y la selfie, identifiqué que el sistema validaba la foto del carnet de identidad con la selfie, sin tener en cuenta otros datos del anverso, tales como el número de DNI. Con esta información, por intuición, realicé una prueba donde dibujé solamente el marco del DNI y añadí una foto de carnet propio para simular el anverso. A pesar de que el sistema no debía permitirlo, logré dar de alta productos financieros sin que se verifiquen adecuadamente los datos de identidad. En conclusión, en ese momento el sistema de validación de identidad a través de selfies no era seguro y permitía que las personas pudieran suplantar la identidad de otra persona con una foto y algunos datos personales de la persona."
    },
    "ECOSISTEMAS": {
        "title": "Ecosistemas",
        "body": "Durante mi trabajo de QA para la empresa DIA, colaboré estrechamente con el equipo de desarrollo encargado de la parte electrónica de los sensores, que utilizaban placas de Arduino para la recepción de datos de geolocalización de heladeras móviles, temperaturas de heladeras y consumo energético en los locales. Con mi amplia experiencia personal en robótica y programación, pude brindarles algunas recomendaciones valiosas para solucionar problemas, en particular cuando surgió una dificultad con un tipo específico de heladera que impedía la conexión de cables. En ese caso, sugerí el uso de una batería de litio específica y un protector de carga para su alimentación, la cual fue implementada en producción según mi recomendación."
    },
    "FRAVEGA": {
        "title": "Frávega",
        "body": "Al iniciar mi participación en el proyecto, nos encontramos con tiempos muy ajustados. Para optimizar nuestras tareas y acelerar la generación de códigos EAN13, automatice su creación mediante programación en Visual Basic .NET. Este proceso nos permitió generar una lista de códigos válidos en segundos, en comparación con la opción manual de generar cada código en una web validando captchas. Es importante destacar que los códigos generados no son números aleatorios, sino que cuentan con un dígito verificador, por lo que se requiere de un cálculo preciso. A los pocos días, fui solicitado por mi líder y su superior para evaluar la posibilidad de automatizar una carga masiva de productos para las distintas familias, ya que era la tarea que más tiempo consumía para las pruebas. Mi experiencia personal me permitió aceptar el desafío y automatizar por medio de coordenadas, lo cual incluyó el control del mouse, teclado y coordenadas a través de la matriz de píxeles de la pantalla. Era necesario interactuar con una extensa cantidad de campos dentro de las solapas en el aplicativo, se necesitaba ingresar la información incluida el plan de pruebas. Después de una semana de trabajo, logré finalizar la aplicación, la cual contribuyó significativamente a la finalización del proyecto dentro de los plazos acordados."
    }
}